; domain
(define (domain whole_wheat_pastry)
  (:requirements :strips :typing)
  (:types
    ingredient tool container object location
  )

  (:predicates
    ;;
    (at ?obj - object ?loc - location)
    ;;
    (in ?ing - ingredient ?c - container)
    ;;
    (mixed ?c - container)
    ;;
    (pastry_ready)
    ;;
    (pastry_in_dish)
    ;;
    (edge_created)
  )

  ;;   1：
  (:action add_flour_and_salt
    :parameters (?flour - ingredient ?salt - ingredient ?bowl - container ?table - location)
    :precondition (and
      (at ?flour ?table)
      (at ?salt ?table)
      (at ?bowl ?table)
    )
    :effect (and
      (in ?flour ?bowl)
      (in ?salt ?bowl)
    )
  )

  ;;   2：
  (:action pour_in_oil
    :parameters (?oil - ingredient ?bowl - container ?flour - ingredient ?salt - ingredient ?table - location)
    :precondition (and
      (in ?flour ?bowl)
      (in ?salt ?bowl)
      (at ?oil ?table)
    )
    :effect (and
      (in ?oil ?bowl)
    )
  )

  ;;   3：
  (:action mix_ingredients
    :parameters (?oil - ingredient ?bowl - container ?flour - ingredient ?salt - ingredient)
    :precondition (and
      (in ?flour ?bowl)
      (in ?salt ?bowl)
      (in ?oil ?bowl)
    )
    :effect (and
      (mixed ?bowl)
    )
  )

  ;;   4：
  (:action prepare_pastry
    :parameters (?bowl - container ?wax_paper - object ?table - location)
    :precondition (and
      (mixed ?bowl)
      (at ?wax_paper ?table)
    )
    :effect (and
      (pastry_ready)
    )
  )

  ;;   5：
  (:action press_into_pie_dish
    :parameters (?pie_dish - container ?table - location)
    :precondition (and
      (pastry_ready)
      (at ?pie_dish ?table)
    )
    :effect (and
      (pastry_in_dish)
    )
  )

  ;;   6：
  (:action create_edge
    :parameters (?fork - object ?table - location)
    :precondition (and
      (pastry_in_dish)
      (at ?fork ?table)
    )
    :effect (and
      (edge_created)
    )
  )
)

; problem
(define (problem make_whole_wheat_pastry)
  (:domain whole_wheat_pastry)
  (:objects
    whole_wheat_flour salt canola_oil - ingredient
    mixing_bowl pie_dish - container
    fork wax_paper - object
    table - location
  )

  (:init
    ;;
    (at whole_wheat_flour table)
    (at salt table)
    (at canola_oil table)
    (at mixing_bowl table)
    (at pie_dish table)
    (at fork table)
    (at wax_paper table)
  )

  (:goal
    (and
      (edge_created)
    )
  )
)

; plan
1. (add_flour_and_salt canola_oil canola_oil mixing_bowl table)
   added: (in canola_oil mixing_bowl)
   goals met: 0 of 1
2. (mix_ingredients canola_oil mixing_bowl canola_oil canola_oil)
   added: (mixed mixing_bowl)
   goals met: 0 of 1
3. (prepare_pastry mixing_bowl canola_oil table)
   added: (pastry_ready)
   goals met: 0 of 1
4. (press_into_pie_dish mixing_bowl table)
   added: (pastry_in_dish)
   goals met: 0 of 1
5. (create_edge canola_oil table)
   added: (edge_created)
   goals met: 1 of 1
